In [5]:
# import libs
import pandas as pd
import numpy as np

/home/irfan/.local/share/virtualenvs/pandas-IIxn-Q33/lib/python3.9/site-packages/pandas/compat/__init__.py:124: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

# Creating Objects

create series

In [2]:
s = pd.Series([1,3,5, np.nan, 6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

creating DataFrame from numpy data, custom index and columns

In [3]:
dates = pd.date_range("20220107", periods=6)
dates

DatetimeIndex(['2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10',
               '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-09  0.585044  0.001465  0.623037  1.047706
2022-01-10 -1.518396 -0.516839  0.248933  0.941531
2022-01-11  0.400335 -1.403150  0.542041  0.007553
2022-01-12 -0.289343  0.122301  0.086315 -0.508745

creating DataFrame from Dictionary

In [5]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220107"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3]*4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2022-01-07  1.0  3   test  foo
1  1.0 2022-01-07  1.0  3  train  foo
2  1.0 2022-01-07  1.0  3   test  foo
3  1.0 2022-01-07  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [7]:
df.head(2)

                   A         B         C         D
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588
2022-01-08 -0.544367 -1.240623  0.283197  0.156292

In [8]:
df.tail(3)

                   A         B         C         D
2022-01-10 -1.518396 -0.516839  0.248933  0.941531
2022-01-11  0.400335 -1.403150  0.542041  0.007553
2022-01-12 -0.289343  0.122301  0.086315 -0.508745

In [9]:
df.index

DatetimeIndex(['2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10',
               '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[-1.02978354e+00, -3.29139956e-01, -4.98109264e-01,
        -1.58843711e-03],
       [-5.44367378e-01, -1.24062273e+00,  2.83196598e-01,
         1.56292380e-01],
       [ 5.85044332e-01,  1.46488367e-03,  6.23036645e-01,
         1.04770642e+00],
       [-1.51839637e+00, -5.16839052e-01,  2.48933319e-01,
         9.41531077e-01],
       [ 4.00335358e-01, -1.40314975e+00,  5.42041193e-01,
         7.55305199e-03],
       [-2.89343122e-01,  1.22300687e-01,  8.63149865e-02,
        -5.08745442e-01]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2022-01-07 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-01-07 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2022-01-07 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-01-07 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.399418 -0.560998  0.214236  0.273792
std    0.811341  0.634047  0.401082  0.602944
min   -1.518396 -1.403150 -0.498109 -0.508745
25%   -0.908430 -1.059677  0.126970  0.000697
50%   -0.416855 -0.422990  0.266065  0.081923
75%    0.227916 -0.081186  0.477330  0.745221
max    0.585044  0.122301  0.623037  1.047706

In [15]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-01-07 00:00:00,2022-01-07 00:00:00,2022-01-07 00:00:00,2022-01-07 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [16]:
df.T

   2022-01-07  2022-01-08  2022-01-09  2022-01-10  2022-01-11  2022-01-12
A   -1.029784   -0.544367    0.585044   -1.518396    0.400335   -0.289343
B   -0.329140   -1.240623    0.001465   -0.516839   -1.403150    0.122301
C   -0.498109    0.283197    0.623037    0.248933    0.542041    0.086315
D   -0.001588    0.156292    1.047706    0.941531    0.007553   -0.508745

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-01-07 -0.001588 -0.498109 -0.329140 -1.029784
2022-01-08  0.156292  0.283197 -1.240623 -0.544367
2022-01-09  1.047706  0.623037  0.001465  0.585044
2022-01-10  0.941531  0.248933 -0.516839 -1.518396
2022-01-11  0.007553  0.542041 -1.403150  0.400335
2022-01-12 -0.508745  0.086315  0.122301 -0.289343

In [18]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-01-12 -0.289343  0.122301  0.086315 -0.508745
2022-01-11  0.400335 -1.403150  0.542041  0.007553
2022-01-10 -1.518396 -0.516839  0.248933  0.941531
2022-01-09  0.585044  0.001465  0.623037  1.047706
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-01-07 -0.001588 -0.498109 -0.329140 -1.029784
2022-01-08  0.156292  0.283197 -1.240623 -0.544367
2022-01-09  1.047706  0.623037  0.001465  0.585044
2022-01-10  0.941531  0.248933 -0.516839 -1.518396
2022-01-11  0.007553  0.542041 -1.403150  0.400335
2022-01-12 -0.508745  0.086315  0.122301 -0.289343

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2022-01-11  0.400335 -1.403150  0.542041  0.007553
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-10 -1.518396 -0.516839  0.248933  0.941531
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588
2022-01-09  0.585044  0.001465  0.623037  1.047706
2022-01-12 -0.289343  0.122301  0.086315 -0.508745

## Getting

In [21]:
# getting a single column
df['A']

2022-01-07   -1.029784
2022-01-08   -0.544367
2022-01-09    0.585044
2022-01-10   -1.518396
2022-01-11    0.400335
2022-01-12   -0.289343
Freq: D, Name: A, dtype: float64

In [22]:
df.A

2022-01-07   -1.029784
2022-01-08   -0.544367
2022-01-09    0.585044
2022-01-10   -1.518396
2022-01-11    0.400335
2022-01-12   -0.289343
Freq: D, Name: A, dtype: float64

In [23]:
# slicing the rows
df[0:3]

                   A         B         C         D
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-09  0.585044  0.001465  0.623037  1.047706

In [24]:
df.index

DatetimeIndex(['2022-01-07', '2022-01-08', '2022-01-09', '2022-01-10',
               '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df['20220107':'20220109']

                   A         B         C         D
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-09  0.585044  0.001465  0.623037  1.047706

### Selection by Label

In [26]:
df.loc[dates[0]]

A   -1.029784
B   -0.329140
C   -0.498109
D   -0.001588
Name: 2022-01-07 00:00:00, dtype: float64

In [27]:
# selecting on multi-axis by label
df.loc[:,['A','B']]
# first param is range of rows, 2nd param is labels of columns

                   A         B
2022-01-07 -1.029784 -0.329140
2022-01-08 -0.544367 -1.240623
2022-01-09  0.585044  0.001465
2022-01-10 -1.518396 -0.516839
2022-01-11  0.400335 -1.403150
2022-01-12 -0.289343  0.122301

In [28]:
df.loc['20220107':'20220109', ['A','B']]

                   A         B
2022-01-07 -1.029784 -0.329140
2022-01-08 -0.544367 -1.240623
2022-01-09  0.585044  0.001465

In [29]:
df.loc['20220110', ['A','B']]

A   -1.518396
B   -0.516839
Name: 2022-01-10 00:00:00, dtype: float64

In [30]:
# getting a scalar value
df.loc[dates[0], 'A']

-1.0297835422735881

In [31]:
# getting a scalar value
df.at[dates[0], 'A']  # fast method

-1.0297835422735881

### Selection by Position

In [32]:
df.iloc[3]  # 3rd row from each column

A   -1.518396
B   -0.516839
C    0.248933
D    0.941531
Name: 2022-01-10 00:00:00, dtype: float64

In [33]:
df.iloc[0:3, 0:2]

                   A         B
2022-01-07 -1.029784 -0.329140
2022-01-08 -0.544367 -1.240623
2022-01-09  0.585044  0.001465

In [34]:
df.iloc[[1,2,4],[0,2,3]]

                   A         C         D
2022-01-08 -0.544367  0.283197  0.156292
2022-01-09  0.585044  0.623037  1.047706
2022-01-11  0.400335  0.542041  0.007553

In [35]:
df.iloc[1:3, : ]

                   A         B         C         D
2022-01-08 -0.544367 -1.240623  0.283197  0.156292
2022-01-09  0.585044  0.001465  0.623037  1.047706

In [36]:
df.iloc[ : , 1:3]

                   B         C
2022-01-07 -0.329140 -0.498109
2022-01-08 -1.240623  0.283197
2022-01-09  0.001465  0.623037
2022-01-10 -0.516839  0.248933
2022-01-11 -1.403150  0.542041
2022-01-12  0.122301  0.086315

In [37]:
df.iat[1,1]

-1.2406227309551654

## Boolean Indexing

In [38]:
df[df['A']>0]

                   A         B         C         D
2022-01-09  0.585044  0.001465  0.623037  1.047706
2022-01-11  0.400335 -1.403150  0.542041  0.007553

In [39]:
df[df>0]

                   A         B         C         D
2022-01-07       NaN       NaN       NaN       NaN
2022-01-08       NaN       NaN  0.283197  0.156292
2022-01-09  0.585044  0.001465  0.623037  1.047706
2022-01-10       NaN       NaN  0.248933  0.941531
2022-01-11  0.400335       NaN  0.542041  0.007553
2022-01-12       NaN  0.122301  0.086315       NaN

In [40]:
df3 = df.copy()

In [41]:
df3["E"] = ["one", "one", "two", "three", "four", "three"]

In [42]:
df3

                   A         B         C         D      E
2022-01-07 -1.029784 -0.329140 -0.498109 -0.001588    one
2022-01-08 -0.544367 -1.240623  0.283197  0.156292    one
2022-01-09  0.585044  0.001465  0.623037  1.047706    two
2022-01-10 -1.518396 -0.516839  0.248933  0.941531  three
2022-01-11  0.400335 -1.403150  0.542041  0.007553   four
2022-01-12 -0.289343  0.122301  0.086315 -0.508745  three

In [43]:
df3[df3['E'].isin(['two','four'])]

                   A         B         C         D     E
2022-01-09  0.585044  0.001465  0.623037  1.047706   two
2022-01-11  0.400335 -1.403150  0.542041  0.007553  four

## Setting

In [65]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [66]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [67]:
df["F"] = s1

In [68]:
# setting values by label
df.at[dates[0], "A"] = 0

In [69]:
df.iat[0, 1] = 0

In [70]:
df.loc[:, "D"] = np.array([5] * len(df))

In [71]:
df

                   A         B         C  D   F
2022-01-07  0.000000  0.000000 -0.498109  5 NaN
2022-01-08 -0.544367 -1.240623  0.283197  5 NaN
2022-01-09  0.585044  0.001465  0.623037  5 NaN
2022-01-10 -1.518396 -0.516839  0.248933  5 NaN
2022-01-11  0.400335 -1.403150  0.542041  5 NaN
2022-01-12 -0.289343  0.122301  0.086315  5 NaN

In [72]:
df3 = df.copy()
df3[df3 > 0] = -df3

In [73]:
df3

                   A         B         C  D   F
2022-01-07  0.000000  0.000000 -0.498109 -5 NaN
2022-01-08 -0.544367 -1.240623 -0.283197 -5 NaN
2022-01-09 -0.585044 -0.001465 -0.623037 -5 NaN
2022-01-10 -1.518396 -0.516839 -0.248933 -5 NaN
2022-01-11 -0.400335 -1.403150 -0.542041 -5 NaN
2022-01-12 -0.289343 -0.122301 -0.086315 -5 NaN

## Missing Data

In [1]:
df

NameError: name 'df' is not defined

In [2]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

NameError: name 'df' is not defined

In [3]:
df1.loc[dates[0]:dates[1], ['E']] = 1

NameError: name 'df1' is not defined

In [77]:
df1.loc[dates[0]:dates[1], ['F']] = 2

In [78]:
df1

                   A         B         C  D    F    E
2022-01-07  0.000000  0.000000 -0.498109  5  2.0  1.0
2022-01-08 -0.544367 -1.240623  0.283197  5  2.0  1.0
2022-01-09  0.585044  0.001465  0.623037  5  NaN  NaN
2022-01-10 -1.518396 -0.516839  0.248933  5  NaN  NaN

In [79]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2022-01-07  0.000000  0.000000 -0.498109  5  2.0  1.0
2022-01-08 -0.544367 -1.240623  0.283197  5  2.0  1.0

In [80]:
df1.fillna(value='5')

                   A         B         C  D    F    E
2022-01-07  0.000000  0.000000 -0.498109  5  2.0  1.0
2022-01-08 -0.544367 -1.240623  0.283197  5  2.0  1.0
2022-01-09  0.585044  0.001465  0.623037  5    5    5
2022-01-10 -1.518396 -0.516839  0.248933  5    5    5

In [81]:
pd.isna(df1)

                A      B      C      D      F      E
2022-01-07  False  False  False  False  False  False
2022-01-08  False  False  False  False  False  False
2022-01-09  False  False  False  False   True   True
2022-01-10  False  False  False  False   True   True

In [82]:
pd.isna(df)

                A      B      C      D     F
2022-01-07  False  False  False  False  True
2022-01-08  False  False  False  False  True
2022-01-09  False  False  False  False  True
2022-01-10  False  False  False  False  True
2022-01-11  False  False  False  False  True
2022-01-12  False  False  False  False  True

## Operations

### Stats

In [83]:
df.mean()

A   -0.227788
B   -0.506141
C    0.214236
D    5.000000
F         NaN
dtype: float64

In [84]:
df.mean(1)

2022-01-07    1.125473
2022-01-08    0.874552
2022-01-09    1.552386
2022-01-10    0.803424
2022-01-11    1.134807
2022-01-12    1.229818
Freq: D, dtype: float64

In [85]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2022-01-07    NaN
2022-01-08    NaN
2022-01-09    1.0
2022-01-10    3.0
2022-01-11    5.0
2022-01-12    NaN
Freq: D, dtype: float64

In [86]:
df.sub(s, axis='index')

                   A         B         C    D   F
2022-01-07       NaN       NaN       NaN  NaN NaN
2022-01-08       NaN       NaN       NaN  NaN NaN
2022-01-09 -0.414956 -0.998535 -0.376963  4.0 NaN
2022-01-10 -4.518396 -3.516839 -2.751067  2.0 NaN
2022-01-11 -4.599665 -6.403150 -4.457959  0.0 NaN
2022-01-12       NaN       NaN       NaN  NaN NaN

### Applying functions to Data

In [87]:
df.apply(np.cumsum)

                   A         B         C   D   F
2022-01-07  0.000000  0.000000 -0.498109   5 NaN
2022-01-08 -0.544367 -1.240623 -0.214913  10 NaN
2022-01-09  0.040677 -1.239158  0.408124  15 NaN
2022-01-10 -1.477719 -1.755997  0.657057  20 NaN
2022-01-11 -1.077384 -3.159147  1.199098  25 NaN
2022-01-12 -1.366727 -3.036846  1.285413  30 NaN

In [88]:
df.apply(lambda x: x.max()-x.min())

A    2.103441
B    1.525450
C    1.121146
D    0.000000
F         NaN
dtype: float64

### Histogramming

In [89]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [90]:
s

0    5
1    4
2    2
3    4
4    3
5    3
6    0
7    2
8    4
9    3
dtype: int64

In [91]:
s.value_counts()

4    3
3    3
2    2
5    1
0    1
dtype: int64

### String Methods

In [6]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object